/* ------------------ */
/* Variables          */
/* ------------------ */

/* 다음 내용을 분석한 후, 프로그래밍 할 수 있도록 변수와 상수를 작성해봅니다. ----------- */

// - 갯수 별 상품 가격 계산하기
// - 구매 제품 가격의 총 합
// - 1년 기준 일(day)자 수 -> ??? 이해불가
// - 구매 결제 여부
// - 구매 결제 내역
// - 브랜드 접두사
// - 오늘의 운세
// - 상품 정보

/* variables ----------------------------------------------------------- */
let dailyFortune = ''; // 오늘의 운세
let totalPrice = 0; // 구매 제품 가격의 총 합

/* constant variables -------------------------------------------------- */
const calcByQuant = () => {}; // 상품의 갯수 기반 계산기 함수
const hasPurchased = true; // 구매 결제 여부
const purchaseHistory = []; // 구매 결제 내역
const BRAND_PREFIX = ''; // 브랜드 접두사
const productInfo = ''; // 상품 정보
